; domain
(define (domain liftedtcore_minigrid-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :existential-preconditions :universal-preconditions :action-costs)
 (:types
    room objectordoor color - object
    object_ door - objectordoor
    empty_0 ball box - object_
 )
 (:constants
   empty - empty_0
   yellow_door_1 red_door_1 - door
 )
 (:predicates (agentinroom ?room - room) (objectinroom ?obj - object_ ?room - room) (objectcolor ?objectordoor - objectordoor ?color - color) (at_ ?objectordoor - objectordoor) (carrying ?obj - object_) (locked ?door - door) (adjacentrooms ?room1 - room ?room2 - room ?door - door) (blocked ?door - door ?obj - object_ ?room - room) (visited ?room - room) (emptyhands) (hold_0) (hold_1))
 (:functions (total-cost))
 (:action gotoobject
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (objectinroom ?obj ?room) (agentinroom ?room))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?obj) (increase (total-cost) 1)))
 (:action gotoempty
  :parameters ()
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ empty) (increase (total-cost) 1)))
 (:action gotodoor
  :parameters ( ?door - door ?room1 - room ?room2 - room)
  :precondition (and (adjacentrooms ?room1 ?room2 ?door) (agentinroom ?room1) (forall (?o - object_)
 (not (blocked ?door ?o ?room1))))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?door) (increase (total-cost) 1)))
 (:action gotoroom
  :parameters ( ?room1 - room ?room2 - room ?door - door)
  :precondition (and (agentinroom ?room1) (adjacentrooms ?room1 ?room2 ?door) (not (locked ?door)))
  :effect (and (not (agentinroom ?room1)) (agentinroom ?room2) (visited ?room2)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (increase (total-cost) 1)))
 (:action pick
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (objectinroom ?obj ?room) (at_ ?obj) (emptyhands))
  :effect (and (not (at_ ?obj)) (not (emptyhands)) (carrying ?obj) (not (objectinroom ?obj ?room))(forall (?d - door) (when (blocked ?d ?obj ?room) (not (blocked ?d ?obj ?room)))) (hold_0) (increase (total-cost) 1)))
 (:action drop
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (carrying ?obj) (not (emptyhands)) (at_ empty))
  :effect (and (not (carrying ?obj)) (at_ ?obj) (not (at_ empty)) (emptyhands) (objectinroom ?obj ?room) (increase (total-cost) 1)))
 (:action toggle
  :parameters ( ?door - door)
  :precondition (and (at_ ?door) (or (and (not (locked ?door)) (= ?door red_door_1)) (and (locked red_door_1) (not (and (locked ?door) (= ?door red_door_1))))))
  :effect (and (when (not (locked ?door)) (locked ?door)) (when (locked ?door) (not (locked ?door))) (when (not (or (and (not (locked ?door)) (= ?door yellow_door_1)) (and (locked yellow_door_1) (not (and (locked ?door) (= ?door yellow_door_1)))))) (hold_1)) (increase (total-cost) 1)))
)

; problem
(define (problem liftedtcore_minigrid-problem)
 (:domain liftedtcore_minigrid-domain)
 (:objects
   room_1 room_2 room_3 room_4 - room
   redtype greentype bluetype yellowtype purpletype greytype - color
   grey_door_1 purple_door_1 - door
   yellow_ball_2 blue_ball_1 yellow_ball_1 green_ball_1 red_ball_1 - ball
   purple_box_1 blue_box_1 grey_box_1 - box
 )
 (:init (agentinroom room_2) (objectinroom blue_ball_1 room_1) (objectinroom purple_box_1 room_1) (objectinroom red_ball_1 room_1) (objectinroom yellow_ball_1 room_3) (objectinroom blue_box_1 room_3) (objectinroom yellow_ball_2 room_3) (objectinroom grey_box_1 room_3) (objectinroom green_ball_1 room_4) (objectcolor blue_ball_1 bluetype) (objectcolor purple_box_1 purpletype) (objectcolor red_ball_1 redtype) (objectcolor yellow_ball_1 yellowtype) (objectcolor blue_box_1 bluetype) (objectcolor yellow_ball_2 yellowtype) (objectcolor grey_box_1 greytype) (objectcolor green_ball_1 greentype) (objectcolor red_door_1 redtype) (objectcolor grey_door_1 greytype) (objectcolor yellow_door_1 yellowtype) (objectcolor purple_door_1 purpletype) (emptyhands) (locked red_door_1) (locked grey_door_1) (locked yellow_door_1) (locked purple_door_1) (adjacentrooms room_2 room_1 red_door_1) (adjacentrooms room_1 room_2 red_door_1) (adjacentrooms room_3 room_1 grey_door_1) (adjacentrooms room_1 room_3 grey_door_1) (adjacentrooms room_4 room_2 yellow_door_1) (adjacentrooms room_2 room_4 yellow_door_1) (adjacentrooms room_4 room_3 purple_door_1) (adjacentrooms room_3 room_4 purple_door_1) (visited room_2) (= (total-cost) 0))
 (:goal (and (exists (?v - box)
 (and (objectcolor ?v purpletype) (objectinroom ?v room_1) (agentinroom room_1) (at_ ?v))) (hold_0) (hold_1)))
 (:metric minimize (total-cost))
)

; plan
1. (gotodoor yellow_door_1 room_2 room_4)
   added: (at_ yellow_door_1)
   goals met: 0 of 3
2. (toggle yellow_door_1)
   deleted: (locked yellow_door_1)
   added: (hold_1)
   goals met: 1 of 3
3. (gotoroom room_2 room_4 yellow_door_1)
   deleted: (agentinroom room_2) (at_ yellow_door_1)
   added: (agentinroom room_4) (visited room_4)
   goals met: 1 of 3
4. (gotodoor purple_door_1 room_4 room_3)
   added: (at_ purple_door_1)
   goals met: 1 of 3
5. (toggle purple_door_1)
   deleted: (locked purple_door_1)
   goals met: 1 of 3
6. (gotoroom room_4 room_3 purple_door_1)
   deleted: (agentinroom room_4) (at_ purple_door_1)
   added: (agentinroom room_3) (visited room_3)
   goals met: 1 of 3
7. (gotodoor grey_door_1 room_3 room_1)
   added: (at_ grey_door_1)
   goals met: 1 of 3
8. (toggle grey_door_1)
   deleted: (locked grey_door_1)
   goals met: 1 of 3
9. (gotoobject blue_box_1 room_3)
   deleted: (at_ grey_door_1)
   added: (at_ blue_box_1)
   goals met: 1 of 3
10. (pick blue_box_1 room_3)
   deleted: (at_ blue_box_1) (emptyhands) (objectinroom blue_box_1 room_3)
   added: (carrying blue_box_1) (hold_0)
   goals met: 2 of 3
11. (gotoroom room_3 room_1 grey_door_1)
   deleted: (agentinroom room_3)
   added: (agentinroom room_1) (visited room_1)
   goals met: 2 of 3
12. (gotoobject purple_box_1 room_1)
   added: (at_ purple_box_1)
   goals met: 3 of 3
